# SQL

Accessing data stored in databases is a routine exercise. I demonstrate a few helpful methods in the Jupyter Notebook.

In [ ]:
!hive create_features.sql

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
!conda install -c conda-forge ipython-sql -y

Fetching package metadata ...........
Solving package specifications: .

# All requested packages already installed.
# packages in environment at /Users/jonathan/miniconda3/envs/py3:
#
ipython-sql               0.3.6                    py35_1    conda-forge

In [3]:
%load_ext sql

In [4]:
%config SqlMagic.autopandas=True

In [5]:
import pandas as pd
import sqlite3

```SQL
CREATE TABLE presidents (first_name, last_name, year_of_birth);
INSERT INTO presidents VALUES ('George', 'Washington', 1732);
INSERT INTO presidents VALUES ('John', 'Adams', 1735);
INSERT INTO presidents VALUES ('Thomas', 'Jefferson', 1743);
INSERT INTO presidents VALUES ('James', 'Madison', 1751);
INSERT INTO presidents VALUES ('James', 'Monroe', 1758);
INSERT INTO presidents VALUES ('Zachary', 'Taylor', 1784);
INSERT INTO presidents VALUES ('Abraham', 'Lincoln', 1809);
INSERT INTO presidents VALUES ('Theodore', 'Roosevelt', 1858);
INSERT INTO presidents VALUES ('Richard', 'Nixon', 1913);
INSERT INTO presidents VALUES ('Barack', 'Obama', 1961);
```

In [6]:
%%sql sqlite://
CREATE TABLE presidents (first_name, last_name, year_of_birth);
INSERT INTO presidents VALUES ('George', 'Washington', 1732);
INSERT INTO presidents VALUES ('John', 'Adams', 1735);
INSERT INTO presidents VALUES ('Thomas', 'Jefferson', 1743);
INSERT INTO presidents VALUES ('James', 'Madison', 1751);
INSERT INTO presidents VALUES ('James', 'Monroe', 1758);
INSERT INTO presidents VALUES ('Zachary', 'Taylor', 1784);
INSERT INTO presidents VALUES ('Abraham', 'Lincoln', 1809);
INSERT INTO presidents VALUES ('Theodore', 'Roosevelt', 1858);
INSERT INTO presidents VALUES ('Richard', 'Nixon', 1913);
INSERT INTO presidents VALUES ('Barack', 'Obama', 1961);

Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

Empty DataFrame
Columns: []
Index: []

In [7]:
later_presidents = %sql SELECT * FROM presidents WHERE year_of_birth > 1825
later_presidents

Done.

  first_name  last_name  year_of_birth
0   Theodore  Roosevelt           1858
1    Richard      Nixon           1913
2     Barack      Obama           1961

In [9]:
type(later_presidents)

pandas.core.frame.DataFrame

In [10]:
con = sqlite3.connect("presidents.sqlite")
later_presidents.to_sql("presidents", con, if_exists='replace')

## Through pandas directly

In [13]:
%%sql
SELECT first_name,
       last_name,
       year_of_birth
FROM presidents
WHERE year_of_birth > 1800;

Done.

  first_name  last_name  year_of_birth
0    Abraham    Lincoln           1809
1   Theodore  Roosevelt           1858
2    Richard      Nixon           1913
3     Barack      Obama           1961

```SQL
SELECT first_name,
       last_name,
       year_of_birth
FROM presidents
WHERE year_of_birth > 1800;
```

In [ ]:
con = sqlite3.connect("presidents.sqlite")
cur = con.cursor()

new_dataframe = pd.read_sql("""SELECT first_name, last_name, year_of_birth
                               FROM presidents
                               WHERE year_of_birth > 1800
                               """, 
                            con=con)

con.close()

In [ ]:
new_dataframe

In [ ]:
type(new_dataframe)